{
    "Vocabulary":[
        {
            "id":1,
            "word":"abound",
            "meaning":"If things abound, or if a place abounds with things, there are very large numbers of them.",
            "sentence":"God is able to make all grace abound toward you, that you, always having all sufficiency in all things, may have an abundance for every good work.",
            "reference":"2 Corinthians 9:8 New King James Version (NKJV)"
        },
        {
            "id":2,
            "word":"amorphous",
            "meaning":"Something that is amorphous has no clear shape or structure.",
            "sentence":"St. Paul's meaning is that the Law was intended to convert sins into transgressions; i.e, to give to amorphous and almost unconscious wickedness a definite form, so that it could be seen, handled, chastised, and cured (Romans 7:8, Romans 7:9).",
            "reference":"The Pulpit Commentaries on Galatians 3:19"
        },
        {
            "id":3,
            "word":"austere",
            "meaning":"An austere way of life is one that is simple and without luxuries",
            "sentence":"For John the Baptist came. Leading an austere life, he thundered out repentance and severe reproofs, and sung, as it were, a plaintive song; while the Lord endeavored, by a cheerful and sprightly song, to draw them more gently to the Father",
            "reference":"Calvin's Commentary on the Bible on Luke 7:33"
        },
        {
            "id":4,
            "word":"belie",
            "meaning":"If one thing belies another, it hides the true situation and so creates a false idea or image of someone or something.",
            "sentence":"Surely the heathen have reason to reprove us when we cannot trust our God, in whom we profess to believe, in the time of peril. In so far as we act as if we had no Divine director, we belie our profession of religion.",
            "reference":"Preacher's Complete Homiletical Commentary on Genesis 20:8-16"
        },
        {
            "id":5,
            "word":"capricious",
            "meaning":"Someone who is capricious often changes their mind unexpectedly.",
            "sentence":" So then, was I indecisive or capricious when I was [originally] planning this? Or the things I plan, do I plan [e]in a self-serving way like a worldly man, ready to say, “Yes, yes” and “No, no” [at the same time]? But [as surely as] God is faithful and means what He says, our message to you is not “Yes” and “No” [at the same time]. ",
            "reference":"1 Corinthians 1:17-18 Amplified Bible"
        },
        {
            "id":6,
            "word":"cerebral",
            "meaning":"If you describe someone or something as cerebral, you mean that they are intellectual rather than emotional.",
            "sentence":"Apologetics is often viewed as an optional endeavor for more cerebral Christians rather than a standard operating feature of Gospel-centered ministry",
            "reference":"https://ratiochristi.org/about/core-pillars/"
        },
        {
            "id":7,
            "word":"congenial",
            "meaning":"A congenial person, place, or environment is pleasant.",
            "sentence":"Circumstances do not change us, but they do expose us. Paul rejoiced in the Lord when circumstances were congenial. Yes, and he also sang praises to Him when his back was bleeding in the Philippian dungeon.",
            "reference":"Pink's Commentary on Hebrews 3:7-12"
        },
        {
            "id":8,
            "word":"conspicuous",
            "meaning":"If someone or something is conspicuous, people can see or notice them very easily.",
            "sentence":"If, for instance, a falsehood of mine has made God's truthfulness more conspicuous, redounding to His glory, why am I judged all the same as a sinner?",
            "reference":"Romans 3:7 Weymouth New Testament"
        },
        {
            "id":9,
            "word":"cursory",
            "meaning":"A cursory glance or examination is a brief one in which you do not pay much attention to detail.",
            "sentence":" Meditation[on God's word] is a fixed duty. It is not a cursory work. Man's thoughts naturally labour with a great inconsistency; but meditation chains them, and fastens them upon some spiritual object.",
            "reference":"Charles Spurgeon Treasury of David Commentary on Psalms 108"
        },
        {
            "id":9,
            "word":"daunting",
            "meaning":"Something that is daunting makes you feel slightly afraid or worried about dealing with it",
            "sentence":"David attacked and soundly defeated the Philistines because of God's promise and power. The writer gave credit to David for the victory ( 1 Samuel 23:5), but clearly it was God who enabled him to win against such a daunting foe ( 1 Samuel 23:4)",
            "reference":"Dr. Constable's Expository Notes on 1 Samuel 23:1-5."
        },
        {
            "id":10,
            "word":"deify",
            "meaning":"If someone is deified, they are considered to be a god or are regarded with very great respect.",
            "sentence":" God wants us to exalt His Word and not men. There must be people in high office, of course. But we are not to deify them. The governor, the mayor, the preacher, the teacher, the scholar, father, mother, are persons whom we are to love and revere, but not to the extent that we forget God.",
            "reference":"Luther's Commentary on Galatians 2:6 "
        },
        {
            "id":11,
            "word":"didactic",
            "meaning":"Something that is didactic is intended to teach people something, especially a moral lesson.",
            "sentence":"2 Thessalonians 2:1-17 - Is partly prophetical, and partly didactic. It contains the doctrine concerning Christ's coming to judgment, and a prophecy concerning some future but great apostasy from the Christian faith.",
            "reference":"Adam Clarke's Commentary on Whole Bible 2 Thessalonians overview"
        },
        {
            "id":12,
            "word":"disseminate",
            "meaning":"To disseminate information or knowledge means to distribute it so that it reaches many people or organizations.",
            "sentence":"Judaizing Christians  pretended to be converted to Christianity, men who sought not only to mingle Judaic elements with the new religion, but to inculcate and disseminate it in that form.",
            "reference":"The Pulpit Commentaries on Titus 1:10-14"
        },
        {
            "id":13,
            "word":"feasible",
            "meaning":"If something is feasible, it can be done, made, or achieved.",
            "sentence":"What was it which again and again overcame the world? Was it not faith, showing itself by self-sacrifice? Is not that secret open to the knowledge, feasible to the practice, of every one of us? ",
            "reference":"The Church Pulpit Commentary on Psalms 16:3"
        },
        {
            "id":14,
            "word":"flout",
            "meaning":"If you flout something such as a law, an order, or an accepted way of behaving, you deliberately do not obey it or follow it.",
            "sentence":" How long must your servant endure? When will you judge those who persecute me? The arrogant have dug pitfalls for me;they flout your law.",
            "reference":"Psalms 119:84-85 New Revised Standard Version"
        },
        {
            "id":15,
            "word":"homogeneous",
            "meaning":"Homogeneous is used to describe a group or thing which has members or parts that are all the same",
            "sentence":" Man is a trinity, consisting of body, mind and spirit. False religions all recognize man as a duality consisting of but the two elements, thus eliminating the third story of humanity, depriving him of his immortal spirit, which is homogeneous to God, and the element on which the Holy Spirit operates, through the human spirit reaching the mind and body.",
            "reference":"Godbey's Commentary on the New Testament on Acts of the Apostle 4:32"
        }
    ]
}