{
  "Vocabulary": [
    [
      "abound",
      "If things abound, or if a place abounds with things, there are very large numbers of them.",
      "God is able to make all grace abound toward you, that you, always having all sufficiency in all things, may have an abundance for every good work.",
      "2 Corinthians 9:8 New King James Version (NKJV)"
    ],
    [
      "amorphous",
      "Something that is amorphous has no clear shape or structure.",
      "St. Paul's meaning is that the Law was intended to convert sins into transgressions; i.e, to give to amorphous and almost unconscious wickedness a definite form, so that it could be seen, handled, chastised, and cured (Romans 7:8, Romans 7:9).",
      "The Pulpit Commentaries on Galatians 3:19"
    ],
    [
      "austere",
      "An austere way of life is one that is simple and without luxuries",
      "For John the Baptist came. Leading an austere life, he thundered out repentance and severe reproofs, and sung, as it were, a plaintive song; while the Lord endeavored, by a cheerful and sprightly song, to draw them more gently to the Father",
      "Calvin's Commentary on the Bible on Luke 7:33"
    ],
    [
      "belie",
      "If one thing belies another, it hides the true situation and so creates a false idea or image of someone or something.",
      "Surely the heathen have reason to reprove us when we cannot trust our God, in whom we profess to believe, in the time of peril. In so far as we act as if we had no Divine director, we belie our profession of religion.",
      "Preacher's Complete Homiletical Commentary on Genesis 20:8-16"
    ],
    [
      "capricious",
      "Someone who is capricious often changes their mind unexpectedly.",
      "So then, was I indecisive or capricious when I was [originally] planning this? Or the things I plan, do I plan [e]in a self-serving way like a worldly man, ready to say, “Yes, yes” and “No, no” [at the same time]? But [as surely as] God is faithful and means what He says, our message to you is not “Yes” and “No” [at the same time]. ",
      "1 Corinthians 1:17-18 Amplified Bible"
    ],
    [
      "cerebral",
      "If you describe someone or something as cerebral, you mean that they are intellectual rather than emotional.",
      "Apologetics is often viewed as an optional endeavor for more cerebral Christians rather than a standard operating feature of Gospel-centered ministry",
      "https://ratiochristi.org/about/core-pillars/"
    ],
    [
      "congenial",
      "A congenial person, place, or environment is pleasant.",
      "Circumstances do not change us, but they do expose us. Paul rejoiced in the Lord when circumstances were congenial. Yes, and he also sang praises to Him when his back was bleeding in the Philippian dungeon.",
      "Pink's Commentary on Hebrews 3:7-12"
    ],
    [
      "conspicuous",
      "If someone or something is conspicuous, people can see or notice them very easily.",
      "If, for instance, a falsehood of mine has made God's truthfulness more conspicuous, redounding to His glory, why am I judged all the same as a sinner?",
      "Romans 3:7 Weymouth New Testament"
    ],
    [
      "cursory",
      "A cursory glance or examination is a brief one in which you do not pay much attention to detail.",
      "Meditation[on God's word] is a fixed duty. It is not a cursory work. Man's thoughts naturally labour with a great inconsistency; but meditation chains them, and fastens them upon some spiritual object.",
      "Charles Spurgeon Treasury of David Commentary on Psalms 108"
    ],
    [
      "daunting",
      "Something that is daunting makes you feel slightly afraid or worried about dealing with it",
      "David attacked and soundly defeated the Philistines because of God's promise and power. The writer gave credit to David for the victory ( 1 Samuel 23:5), but clearly it was God who enabled him to win against such a daunting foe ( 1 Samuel 23:4)",
      "Dr. Constable's Expository Notes on 1 Samuel 23:1-5."
    ],
    [
      "deify",
      "If someone is deified, they are considered to be a god or are regarded with very great respect.",
      "God wants us to exalt His Word and not men. There must be people in high office, of course. But we are not to deify them. The governor, the mayor, the preacher, the teacher, the scholar, father, mother, are persons whom we are to love and revere, but not to the extent that we forget God.",
      "Luther's Commentary on Galatians 2:6 "
    ],
    [
      "didactic",
      "Something that is didactic is intended to teach people something, especially a moral lesson.",
      "2 Thessalonians 2:1-17 - Is partly prophetical, and partly didactic. It contains the doctrine concerning Christ's coming to judgment, and a prophecy concerning some future but great apostasy from the Christian faith.",
      "Adam Clarke's Commentary on Whole Bible 2 Thessalonians overview"
    ],
    [
      "disseminate",
      "To disseminate information or knowledge means to distribute it so that it reaches many people or organizations.",
      "Judaizing Christians  pretended to be converted to Christianity, men who sought not only to mingle Judaic elements with the new religion, but to inculcate and disseminate it in that form.",
      "The Pulpit Commentaries on Titus 1:10-14"
    ],
    [
      "feasible",
      "If something is feasible, it can be done, made, or achieved.",
      "What was it which again and again overcame the world? Was it not faith, showing itself by self-sacrifice? Is not that secret open to the knowledge, feasible to the practice, of every one of us? ",
      "The Church Pulpit Commentary on Psalms 16:3"
    ],
    [
      "flout",
      "If you flout something such as a law, an order, or an accepted way of behaving, you deliberately do not obey it or follow it.",
      "How long must your servant endure? When will you judge those who persecute me? The arrogant have dug pitfalls for me;they flout your law.",
      "Psalms 119:84-85 New Revised Standard Version"
    ],
    [
      "homogeneous",
      "Homogeneous is used to describe a group or thing which has members or parts that are all the same",
      "Man is a trinity, consisting of body, mind and spirit. False religions all recognize man as a duality consisting of but the two elements, thus eliminating the third story of humanity, depriving him of his immortal spirit, which is homogeneous to God, and the element on which the Holy Spirit operates, through the human spirit reaching the mind and body.",
      "Godbey's Commentary on the New Testament on Acts of the Apostle 4:32"
    ],
    [
      "humdrum",
      "If you describe someone or something as humdrum, you mean that they are ordinary, dull, or boring.",
      "He who has sense or “understanding”, “walks straight”, which is the way of life that leads into eternal life. The fool follows every fad and lives by the everyday humdrum. Such a life is pleasing to him, for he has no understanding in God’s will, which he does not want either",
      "Kingcomments on the Whole Bible on Proverbs 15:20-21"
    ],
    [
      "insipid",
      "If you describe someone or something as insipid, you mean they are dull and boring.",
      "Ye are the salt of the earth; but if the salt have become insipid, wherewith shall it be salted? It is no longer fit for anything but to be cast out and to be trodden under foot by men.",
      "Matthew 5:13 Darby Translation"
    ],
    [
      "loquacious",
      "If you describe someone as loquacious, you mean that they talk a lot.",
      "Paul did not use the loquacious rhetoric or \"great swelling words of emptiness\" (II Peter 2:18) of the Greek and Roman schools of oratory. When we read what Paul wrote, then we can know what he knew by divine revelation.",
      "Turner's Commentary on Ephesians and Philippians on Ephesians 3:4"
    ],
    [
      "misanthropic",
      "If you describe a person or their feelings as misanthropic, you mean that they do not like other people.",
      "Under the pressure of loneliness, a man may relax his efforts, or he may fall into a discontented, desponding, and cynical frame of mind. He may lose his interest in life and in human affairs generally. He may even become misanthropic and skeptical",
      "The Pulpit Commentaries on Ecclesiastes 4:1-16"
    ],
    [
      "misnomer",
      "If you say that a word or name is a misnomer, you mean that it describes something incorrectly.",
      "Does the word: servant \"sound like a misnomer?\" — \"not servants...but I have called you friends.\"  Though he calls me \"friend, \"I shall never cease to call him \"Master.\"",
      "Treasury of David on Psalms 119:1-176"
    ],
    [
      "negligent",
      "If you describe a person's movements or manner as negligent, you mean that they look relaxed and informal.",
      "My sons, do not now be negligent, for the Lord has chosen you to stand in his presence, to minister to him and to be his ministers and make offerings to him.\"",
      "2 Chronicles 29:11 ESV"
    ],
    [
      "obsequious",
      "If you describe someone as obsequious, you are criticizing them because they are too eager to help or agree with someone more important than them.",
      "Profess no more than you have. But I want the world to know that where there is one hypocrite in the church, there are five hundred outside of it, for the reason that the field is larger. There are men in all circles that will bow before you, and who are obsequious in your presence, and talk flatteringly, but who, all the while they are in your conversation, are digging for bait and angling for imperfections. I",
      "The Biblical Illustrator on 1 Samuel 15:14"
    ],
    [
      "placate",
      "If you placate someone, you do or say something to make them stop feeling angry.",
      "Herod had arrested John, put him in chains, and sent him to prison to placate Herodias, his brother Philip's wife. John had provoked Herod by naming his relationship with Herodias \"adultery.\" Herod wanted to kill him, but he was afraid because so many people revered John as a prophet of God.",
      "Matthew 14:3-5 THE MESSAGE TRANSLATION"
    ],
    [
      "proclivity",
      "A proclivity is a tendency to behave in a particular way or to like a particular thing, often a bad way or thing.",
      " The terrible suffering which would come with the fall of Jerusalem and Judah, predicted by First Isaiah, literally came to pass in 587 (or 586) b.c., but the suffering did not bring with it the removal of the proclivity to sin in the human heart. Second Isaiah (chs. 40-55) prophesied the coming salvation of Israel from exile and with it the redemption of the whole world through the Servant People who were to be purified and renewed. ",
      "Layman's Bible Commentary on Isaiah 66:1-24"
    ],
    [
      "puerile",
      "If you describe someone or something as puerile, you mean that they are silly and childish.",
      "we must take heed that we do not diminish the authority of God’s revealed will, either by puerile flourishings of words, or philosophical argumentation",
      "Poole's English Annotations on the Holy Bible on 1 Corinthians 1:17 "
    ],
    [
      "quixotic",
      "If you describe someone's ideas or plans as quixotic, you mean that they are imaginative or hopeful but unrealistic.",
      "Just over a century ago Robert Morrison set sail for China; it seemed a quixotic business. “Do you think,” said the captain of the ship in which he sailed, “that you are going to convert China?” “No,” replied Morrison, “but I believe that God will.",
      "Ellicott's Commentary for English Readers on John 14:15-17 "
    ],
    [
      "spendthrift",
      "If you call someone a spendthrift, you mean that they spend too much money.",
      "To get money without work is always a perilous thing. You see it in the spendthrift who inherits money from a penurious father, and who gets rid of it with all the rapidity he can. There is a proverb in Lancashire that “From shirt-sleeves to shirt-sleeves is only three generations,” ",
      "Preacher's Complete Homiletical Commentary on Matthew 27:35-44 "
    ],
    [
      "taciturn",
      "A taciturn person does not say very much and can seem unfriendly.",
      "As wine causes the most backward to speak, so thy charms make the most taciturn eloquent in thy praise. ",
      "Preacher's Complete Homiletical Commentary on Song of Solomon 7:8-9"
    ],
    [
      "wary",
      "If you are wary of something or someone, you are cautious because you do not know much about them and you believe they may be dangerous or cause problems.",
      "Be wary of false preachers who smile a lot, dripping with practiced sincerity. Chances are they are out to rip you off some way or other. Don't be impressed with charisma; look for character.",
      "Matthew 7:15-20 THE MESSAGE TRANSLATION"
    ]
  ]
}